# StringParameterValue Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StringParameterValue Constructor
StringParameterValue Class See Also
---
Default constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public StringParameterValue()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
StringParameterValue()
```

# See Also
StringParameterValue Class
StringParameterValue Overload
Autodesk.Revit.DB Namespace